#字典的简单操作，将字典的键值对通过for赋值给另一个字典
# 嵌套字典={}
# 嵌套字典["法国访问过的城市"]="Paris","Lille","Dijon"
# print(嵌套字典)
list1 = [
    {
        "国家":"法国",
        "访问过的城市":["Paris","Lille","Dijon"],
        "访问次数":12
    },
    {
        "国家":"德国",
        "访问过的城市":["柏林","丧失","D"],
        "访问次数":2
    }
    ]
# for a in list1:
#     print(a["访问过的城市"][0])

新国家=("中国",["郑州","西安","重庆"],2)

list1.append({"国家":新国家[0],"访问过的城市":新国家[1],"访问次数":新国家[2]})
print(list1)
# for a in 新国家:
#     print()
    # list1.append(list2[])
    



# print(type(新国家))



